IOdRxReferenceType.dereference(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,IOdRxReferenceType.OpenMode)
\details
Open the object in the specified mode.
\param value [in] Value object to open.
\param mode  [in] Mode to open the value object in.
\returns
Smart pointer to opened object.
\remarks
Returned object will be automatically closed when the smart pointer is
released, as usual.